# Завдання 1
# Написати функцію, яка приймає параметрами 2 аргументи і повертає результатом їх приватне, де перший аргумент - ділене,
# а другий - дільник (перший розділити на другий). Обробити ZeroDivizionError, повернути 0 і вивести повідомлення про
# помилку, що на 0 ділити не можна.

def divide(a, b):
    try:
        return a / b
    except ZeroDivisionError:
        print("Помилка: на 0 ділити не можна")
        return 0

print(divide(10, 2))   # 5.0
print(divide(5, 0))    # повідомлення + 0


# Завдання 2
# Написати функцію, яка повертає елемент зі списку за індексом. Приймає 2 аргументи: список та індекс.
# Написати обробку виключення - якщо в списку такого індексу немає, вивести повідомлення про помилку та повернути -1.

def get_element(lst, index):
    try:
        return lst[index]
    except IndexError:
        print("Помилка: такого індексу не існує")
        return -1

a = [10, 20, 30]

print(get_element(a, 1))  # 20
print(get_element(a, 5))  # повідомлення + -1