# Є 2 множини A = {3, 5, 11, 7, 4 -3}, B = {11, 5, 8, 1, 10, 7} Завдання 1 Вивести в консоль елементи A, яких немає в B.
# Завдання 2 Вивести в консоль загальні елементи А та В. Завдання 3 Вивести в консоль об'єднання множин А та В.
# Завдання 4 Чи є рядок a = “a14b6fh”, як дізнатися, що всі символи унікальні, використовуючи множини та списки?

A = {3, 5, 11, 7, 4, -3}
B = {11, 5, 8, 1, 10, 7}
# 1
print(A - B)

#2
print(A & B)
#3
print(A | B)
#4
a = "a14b6fh"

chars = list(a)
unique_chars = set(chars)

if len(chars) == len(unique_chars):
    print("Всі символи унікальні")
else:
    print("Є повторювані символи")