# Домашня робота лекція 2 Болдорат В.О.

# STRING

# в тій же REPL створіть рядок (“I am learning Python”) і за допомогою вбудованих
# методів:
# - отримайте з нього рядок, що складається з великих (маленьких) символів
# - отримуйте рядок в якому базовий рядок буде відцентровано в рядку з 100
# символів з заповненням зліва і справа - пробілами, знаками “-”
# - отримайте кількість в рядку символів “n”, пробілів.
# - * (ускладнене) - за допомогою вбудованих методів отримайте з базового рядок в
# якому всі пробіли замінені на символ “+”, символ “e” -> “a”, “a” -> “e”

sentence = "I am learning Python"

print(sentence)
print(sentence.upper())  # верхній регістр
print(sentence.lower())  # нижній

print(sentence.center(100))  # пробілами
print(sentence.center(100, "-"))  # дефісами

print(sentence.replace(" ", "+").replace("e", "a").replace("a", "e"))  # заміна

#BOOL
# Напиши скрипт який оцінює результат наступного вислову на основі
# базових параметрів і друкує результат: “наша команда вийде в наступний
# етап чемпіонату якщо ми переможемо команду “Метелик”, не програємо
# команді “Мураха”, а команда “Муха” або програє “Метелику”, або зіграє в
# нічию з командою “Мураха””.

win_metelik = True
lose_myraha = False
myha_lose_metelik = False
myha_draw_myraha = False #нічия - draw

result_match = win_metelik and not lose_myraha and (myha_lose_metelik or myha_draw_myraha)

print("Чи вийде наша команда в наступний етап чемпіонату? ", result_match)