# Завдання 1
# Написати функцію, яка приймає 2 аргументи – цілих числа. Усередині функції робиться перевірка
# типу. Якщо хоча б одне з них не int, то повертається 1, якщо обидва int, то вважається їхня сума.
# Якщо сума позитивна, повертається 0, якщо негативна, то -1.


def check_and_sum(a, b):
    if not isinstance(a, int) or not isinstance(b, int):
        return 1

    s = a + b
    if s > 0:
        return 0
    elif s < 0:
        return -1
    else:
        return 0

print(check_and_sum(3, 5))      # 0
print(check_and_sum(-10, 3))   # -1
print(check_and_sum("3", 5))   # 1

# Завдання 2
# Написати функцію, яку передається аргументом інша функція. Всередині приймаючої функції
# зробіть виведення в консоль “Початок дзвінка”, після чого викличте функцію та результат
# виведіть у консоль, після чого виведіть у консоль “Кінець дзвінка”. Для прикладу можете
# написати функцію додавання 2 чисел і передати її в приймаючу функцію.

def call_function(func, a, b):
    print("Початок дзвінка")
    result = func(a, b)
    print(result)
    print("Кінець дзвінка")

def add(x, y):
    return x + y

call_function(add, 4, 6)