# Завдання 1
# Дано два рядки. Виведіть на екран символи, які є в обох рядках.
from random import choice

some_str1 = set("привіт")
some_str2 = set("світло")
common_elements =  some_str1.intersection(some_str2)
print("Символи, що є в обох рядках: ")
for element in common_elements:
    print(element)

# Завдання 2
# Створіть програму, яка емулює роботу сервісу зі скорочення посилань. Повинна бути реалізована можливість введення
# початкового посилання та короткої назви і отримання початкового посилання за її назвою.
# Словник для збереження пар "коротка назва" → "повне посилання"
links = {}

while True:
    print("\n🔗 Меню:")
    print("1 - Додати нове посилання")
    print("2 - Отримати повне посилання за короткою назвою")
    print("3 - Переглянути всі посилання")
    print("0 - Вихід")

    choice = input("Ваш вибір: ")

    if choice == "1":
        full_link = input("Введіть повне посилання: ")
        short_name = input("Введіть коротку назву: ")
        links[short_name] = full_link
        print("Посилання збережено!")

    elif choice == "2":
        short_name = input("Введіть коротку назву: ")
        if short_name in links:
            print("Повне посилання:", links[short_name])
        else:
            print("Такої короткої назви немає в базі!")

    elif choice == "3":
        print("\nУсі збережені посилання:")
        for short, full in links.items():
            print(f"{short} → {full}")

    elif choice == "0":
        print("Вихід із програми.")
        break

    else:
        print("Невірний вибір, спробуйте ще раз.")



# Завдання 3
# Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору,
# які є в 1 списку (немає в другому) і навпаки.
# v1
a = list(range(12,23))
b = list(range(17,38))

set_a = set(a)
set_b = set(b)

unique_1 = set_a - set_b   # тільки в першому
unique_2 = set_b - set_a   # тільки в другому

print("Унікальні елементи лише в першому списку:", unique_1)
print("Унікальні елементи лише в другому списку:", unique_2)

# v2
a = list(range(12, 23))
b = list(range(17, 38))
print("Унікальні елементи лише в першому:", set(a) - set(b))
print("Унікальні елементи лише в другому:", set(b) - set(a))

# Завдання 4
# Ознайомтеся за допомогою документації з класами OrderedDict, defaultdict та ChainMap модуля collections.

from collections import OrderedDict

data = OrderedDict()
data["яблуко"] = 3
data["банан"] = 5
data["вишня"] = 2

for k, v in data.items():
    print(k, v)
# -------------------------
from collections import defaultdict

fruits = defaultdict(int)  # значення за замовчуванням — 0

fruits["яблуко"] += 3
fruits["банан"] += 2
print(fruits)
# -------------------------
from collections import ChainMap

settings_default = {"theme": "light", "lang": "en"}
settings_user = {"theme": "dark"}

combined = ChainMap(settings_user, settings_default)
print(combined["theme"])  # 'dark' (берётся з першого словника)
print(combined["lang"])   # 'en'   (береться з другого)

# Завдання 5
# Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями -
# кількістю повторів кожного слова у послідовності.
# v1
text = input("Введіть текст(до 1000 слів): ").lower().split()
word_count = {}

for word in text:
    if word in word_count:
        word_count[word] += 1
    else:
        word_count[word] = 1
print("Словник частоти слів: ")
for k,v in word_count.items():
    print(f"{k}: {v}")
# v2
from collections import Counter

text = input("Введіть текст: ").lower().split()
word_count = Counter(text)

print("Словник частот слів:")
for k, v in word_count.items():
    print(f"{k}: {v}")

# Завдання 6
# Створіть прототип програми «Бібліотека», де є можливість перегляду та внесення змін за структурою: автор: твір.
# Передбачте можливість виведення на екран сортування за автором та твором.
library = {
    "Шевченко": "Кобзар",
    "Франко": "Захар Беркут",
    "Гоголь": "Тарас Бульба"
}

while True:
    print("Меню:")
    print("1 - переглянути бібліотеку")
    print("2 - додати або змінити запис")
    print("3 - сортувати за автором")
    print("4 - сортувати за твором")
    print("0 - вихід")

    choice = input("Ваш вибір: ")
        if choice == "1":
            for author, work in library.items():
                print(f"{author}: {work}")
        elif choice == "2":
            author = input("Введіть автора: ")
            work = input("Введіть твір: ")
            library[author] = work
            print("Збережено!")
        elif choice == "3":
            print("Сортування за автором: ")
            for author, work in sorted(library.items()):
                print(f"{author}: {work}")
        elif choice == "4":
            print("Сортування за твором: ")
            for author, work in sorted(library.items(), key=lambda x: x[1]): #сортувати не по автору х[0] а по творам х[1]
        elif choice == "0":
            print("До побачення!")
            break
        else:
            print("Невірний вибір, спробуйте ще раз")
# Завдання 7
# Створіть прототип програми «Облік кадрів», в якій є можливість перегляду та внесення змін до структури
# (реалізуйте інтерфейс(меню), за допомогою якого можна робити маніпуляції з даними):
# прізвище:
#     посада: ...
#     досвід роботи: …
#     портфоліо: …
#     коефіцієнт ефективності: …
#     стек технологій: …
#     зарплата: …
# Передбачте можливість виведення на екран сортування за прізвищем та найефективнішим співробітником

epmloyees = {
    "Іванов": {
        "посада":"програміст",
        "досвід роботи": 3,
        "портфоліо":"github.com/ivanov1996",
        "коефіцієнт ефективності": 1.05,
        "стек технологій": "Python, C++",
        "зарплата": 55000
    }
    "Петров": {
        "посада": "тестувальник",
        "досвід роботи": 1,
        "портфоліо": "github.com/petrov_the_best",
        "коефіцієнт ефективності": 0.96,
        "стек технологій": "QA",
        "зарплата": 45000
    }
    "Мірошниченко": {
        "посада": "motion designer",
        "досвід роботи": 3,
        "портфоліо": "pinterest.com/miro",
        "коефіцієнт ефективності": 3,
        "стек технологій":"adobe, figma, blender",
        "зарплата": 80000
    }
}
while True:
    print("\nМеню:")
    print("1 - переглянути співробітників")
    print("2 - додати або змінити співробітника")
    print("3 - сортувати за прізвищем")
    print("4 - найефективніший співробітник")
    print("0 - вихід")
    choice = input("Ваш вибір:\t")
    if choice == "1":
        for name,data in epmloyees.items():
            print(f"\n{name}:")
            for key,value in data.items():
                print(f"{key}: {value}")

    elif choice == "2":
        name = input("Введіть прізвище: ")
        position = input("Посада: ")
        expiriense = input("Досвід роботи (років): ")
        portfolio = input("Портфоліо: ")
        efficiency = float(input("Коефіцієнт ефективності (0–3): "))
        tech = input("Стек технологій: ")
        salary = int(input("Зарплата: "))
        employees[name] = {
            "посада": position,
            "досвід роботи": exp,
            "портфоліо": portfolio,
            "коефіцієнт ефективності": efficiency,
            "стек технологій": tech,
            "зарплата": salary
        }
        print("Запис збережено.")

    elif choice == "3":
        print("\nСортування за прізвищем:")
        for name in sorted(epmloyees.keys()):
            print(name)

    elif choice == "4":
        best = max(epmloyees.items(), key=lambda x: x[1]["коефіцієнт ефективності"])

    elif choice == "0":
        print("До побачення!")
        break
    else:
        print("Невірний вибір, спробуйте ще раз")