# Домашня робота лекція 2 Болдорат В.О.
# IfElse
# 1 Напишіть скрипт, який визначає яким є введене число - парним чи непарним.

number = int(input("Введіть число: "))
if number % 2 == 0:
    print(number, " - Число парне")
else:
    print(number, " - Число непарне")

# 2- напишіть скрипт який отримує на вхід будь-яке число. Скрипт повинен класифікувати введене число з точки зору -
# “позитивне/негативне” і
# “однозначне/двозначне/трьохзначне/більше ніж троьохзначне”. Ноль -враховувати як окремий варіант.
# Приклад виводу для:
# -	25 - “двозначне позитивне”
# -	-345 - “тризначне негативне”
# -	2345 - “більше ніж трьохзначне позитивне”
# -	0 - “ноль”

# варіант 1:
number = int(input("Введіть число: "))
if number == 0:
    print("ноль")
else:
    status_number = "позитивне" if number > 0 else "негативне"
    length_number = len(str(abs(number)))  # знаходимо кіл-ть знаків числа
    if length_number == 1:
        digit_number = "однозначне"
    elif length_number == 2:
        digit_number = "двозначне"
    elif length_number == 3:
        digit_number = "тризначне"
    else:
        digit_number = "більше ніж трьохзначне"
    print(digit_number, status_number)

# варіант 2 тернарні оператори
num = int(input("Введіть число: "))
print("ноль" if num == 0 else "однозначне " + ("позитивне" if num > 0 else "негативне") if len(str(abs(num))) == 1 else "двозначне " + ("позитивне" if num > 0 else "негативне") if len(str(abs(num))) == 2 else "тризначне " + ("позитивне" if num > 0 else "негативне") if len(str(abs(num))) == 3 else "більше ніж трьохзначне " + ("позитивне" if num > 0 else "негативне"))

# Hапишіть скрипт, на початку якого Ви будете присвоювати двом змінним рядкові літерали, які повинні відповідати числам (“123”, “78.77”, “-32.67”…)
# уявіть що ці числа вводить користувач і, таким чином, можуть бути допущені різного роду помилки при вводі
# -	пробіли на початку і в кінці
# -	кома замість крапки при вводі
# -	пробіл після знаку “-” перед числом
# -	знак “+” перед числом
# Ви повинні за допомогою методів рядків попередньо обробити ці рядки щоб зменшити кількість помилок при перетворенні рядка в число.
# Далі Ви повинні перетворити ці рядки на числа - ﬂoat.
# Після цього надрукувати результат суми цих чисел і їх різниці, відформатований за допомогою f-рядків, точність при
# виводі числа - два знаки після коми (міні-мова форматування).

string1 = input("Введіть перше число: ")
string2 = input("Введіть друге число: ")

string1 = string1.strip().replace(" ", "").replace(",", ".").lstrip("+")
string2 = string2.strip().replace(" ", "").replace(",", ".").lstrip("+")
number1 = float(string1)
number2 = float(string2)

print(f"Сума: {(number1 + number2):.2f}")
print(f"Різниця: {(number1 - number2):.2f}")